Управление_по_целям_и_KPI/src/Documents/KPI_Табель/KPI_Табель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_Табель</name>
  <registerRecords>AccumulationRegister.KPI_РабочееВремяСотрудников</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.KPI_Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтработанноеВремя</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.KPI_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Часов1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов13</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов14</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов15</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов16</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов17</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов19</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов20</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов21</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов22</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов23</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов24</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов25</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов26</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов27</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов28</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов29</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов30</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов31</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Documents/KPI_Табель/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОтработанноеВремяСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия    = Новый Структура("Филиал", Объект.Филиал);
	ФормаВыбора          = ОткрытьФорму("Справочник.KPI_Сотрудники.ФормаВыбора", ПараметрыОткрытия , Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремяСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтработанноеВремя.ТекущиеДанные;
	ЗаполнитьОтработанноеВремяСотрудника(ТекущиеДанные.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтработанноеВремяСотрудника(Сотрудник)
	
	ОтборСотрудника = Новый Структура("Сотрудник",Сотрудник);
	НайденныеСтроки = Объект.ОтработанноеВремя.НайтиСтроки(ОтборСотрудника);
	
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		ТекстВопроса = "Перезаполнить отработанные часы по " + Сотрудник + "?";
		Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Для Каждого Стр из НайденныеСтроки Цикл
				Объект.ОтработанноеВремя.Удалить(Стр);
			КонецЦикла;
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьОтработанныеЧасы(Сотрудник);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтработанныеЧасы(Сотрудник = Неопределено,Списком = Ложь)
	
	Если Списком Тогда 
		Объект.ОтработанноеВремя.Очистить();
	Иначе 
		ОтборСотрудника = Новый Структура("Сотрудник",Сотрудник);
		НайденныеСтроки = Объект.ОтработанноеВремя.НайтиСтроки(ОтборСотрудника);
		Для Каждого Стр из НайденныеСтроки Цикл
			Объект.ОтработанноеВремя.Удалить(Стр);
		КонецЦикла;
	КонецЕсли;
	
	ВыборкаСотрудников = Неопределено;
	
	НачалоПериода = НачалоМесяца(Объект.Дата);
	КонецПериода  = КонецМесяца(Объект.Дата);
	
	Если Списком Тогда
		ВыборкаСотрудников = KPI_ИнтерфейсСервер.РабочееВремяСотрудников(НачалоПериода,КонецПериода,Объект.Филиал);
	Иначе 
		ВыборкаСотрудников = KPI_ИнтерфейсСервер.РабочееВремяСотрудников(НачалоПериода,КонецПериода,Сотрудник);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыборкаСотрудников) Тогда
	    Возврат;
	КонецЕсли;
	
	Пока ВыборкаСотрудников.Следующий() Цикл
		Стр                         = Объект.ОтработанноеВремя.Добавить();
		Стр.Сотрудник               = ВыборкаСотрудников.Сотрудник;
		ВыборкаОтработанногоВремени = ВыборкаСотрудников.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОтработанногоВремени.Следующий() Цикл
			Стр[ВыборкаОтработанногоВремени.РабочийДень] =  ВыборкаОтработанногоВремени.Часы;	 
		КонецЦикла;
	КонецЦикла;			
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремяЗаполнитьПодбором(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрыватьПриВыборе",Ложь);
	ДополнительныеПараметры.Вставить("Филиал",Объект.Филиал);
	KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата, Элементы.ОтработанноеВремя,,,,ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремяЗаполнитьСписком(Команда)
	
	Если ЗначениеЗаполнено(Объект.Филиал) Тогда
		ЗаполнитьОтработанныеЧасы(,Истина);
	Иначе 
		KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Ошибка! Не указан филиал.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Сотрудник") Тогда
		 ЗаполнитьОтработанноеВремяСотрудника(ВыбранноеЗначение.Сотрудник);
	КонецЕсли;
	
КонецПроцедуры
